#!/usr/bin/python
# -*- coding: UTF-8 -*-

import math
import cmath

# 拓展：将此数学计算包装成一个方法或者类（待完成）

a = round(3.1415926, 3)  # 对3.1415926这个数四舍五入，保留3位小数
b = math.ceil(3.1415926)  # 对3.1415926这个数向上圆整
c = math.floor(3.1415926)  # 对3.1415926这个数向下圆整
d = math.sqrt(1.44)  # 对1.44这个数取平方根（不可用于负数）
e = cmath.sqrt(-9)  # 对-9取平方根（可用于负数）
f = pow(3, 4, 2)  # 3^4对2取余

print("对3.1415926这个数四舍五入，保留3位小数,结果为：%s\n"
      "对3.1415926这个数向上圆整，结果为：%s\n"
      "对3.1415926这个数向下圆整，结果为：%s\n"
      "对1.44这个数取平方根（不可用于负数），结果为：%s\n"
      "对-9取平方根（可用于负数），结果为：%s\n"
      "3^4对2取余，结果为：%s" % (a, b, c, d, e, f))
